tak-tests/tak-performance/src/test/resources/data/SokVagvalsInfo_hamtaAllaVirtualiseringar.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:skl:tp:vagvalsinfo:v2">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:hamtaAllaVirtualiseringar>?</urn:hamtaAllaVirtualiseringar>
   </soapenv:Body>
</soapenv:Envelope>